app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "Test Title"], ["description", "test description"], ["created_at", "2021-01-14 15:18:19.570985"], ["updated_at", "2021-01-14 15:18:19.570985"], ["author_id", 6]]
---
  def create
    @post = Post.new(post_params)
    @post.save